Tester/src/Documents/Job/Job.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Job</name>
  <posting>Deny</posting>
  <attributes>
    <name>Agent</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Computer</name>
    <type>
      <types>CatalogRef.Computers</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>IgnoreCompletion</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Job</name>
    <type>
      <types>DocumentRef.Job</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Mode</name>
    <type>
      <types>EnumRef.Running</types>
    </type>
  </attributes>
  <attributes>
    <name>Parameters</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Scenario</name>
    <type>
      <types>CatalogRef.Scenarios</types>
    </type>
  </attributes>
  <attributes>
    <name>Schedule</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Scenarios</name>
    <attributes>
      <name>Application</name>
      <type>
        <types>CatalogRef.Applications</types>
      </type>
    </attributes>
    <attributes>
      <name>Scenario</name>
      <type>
        <types>CatalogRef.Scenarios</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Tester/src/Enums/JobStatuses/JobStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>JobStatuses</name>
  <enumValues>
    <name>Fault</name>
  </enumValues>
  <enumValues>
    <name>Passed</name>
  </enumValues>
  <enumValues>
    <name>Pending</name>
  </enumValues>
  <enumValues>
    <name>Removed</name>
  </enumValues>
  <enumValues>
    <name>Running</name>
  </enumValues>
</mdclass:Enum>

Tester/src/Documents/Job/Forms/List/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	loadParams ();
	setFilter ();
	
EndProcedure

&AtServer
Procedure loadParams ()
	
	ScenarioFilter = Parameters.Scenario;
	
EndProcedure 

&AtServer
Procedure setFilter ()
	
	if ( ScenarioFilter = undefined ) then
		CreatorFilter = SessionParameters.User;
		filterByCreator ();
	else
		filterByScenario ();
	endif;
	
EndProcedure 

&AtServer
Procedure filterByCreator ()
	
	DC.ChangeFilter ( List, "Creator", CreatorFilter, not CreatorFilter.IsEmpty () );
	
EndProcedure

&AtServer
Procedure filterByScenario ()
	
	DC.ChangeFilter ( List, "Scenarios.Scenario", ScenarioFilter, not ScenarioFilter.IsEmpty () );
	
EndProcedure

// *****************************************
// *********** Group Form

&AtClient
Procedure Refresh(Command)
	
	Items.List.Refresh ();
	Items.Agents.Refresh ();
	
EndProcedure

&AtClient
Procedure CreatorFilterOnChange ( Item )
	
	filterByCreator ();
	
EndProcedure

&AtClient
Procedure ScenarioFilterOnChange ( Item )
	
	filterByScenario ();
	
EndProcedure

&AtClient
Procedure AgentFilterOnChange ( Item )
	
	filterByAgent ();
	
EndProcedure

&AtServer
Procedure filterByAgent ()
	
	DC.ChangeFilter ( List, "Agent", AgentFilter, not AgentFilter.IsEmpty () );
	
EndProcedure

&AtClient
Procedure ModeFilterOnChange ( Item )
	
	filterByMode ();
	
EndProcedure

&AtServer
Procedure filterByMode ()
	
	DC.ChangeFilter ( List, "Mode", ModeFilter, not ModeFilter.IsEmpty () );
	
EndProcedure

// *****************************************
// *********** List

&AtClient
Procedure ListSelection ( Item, SelectedRow, Field, StandardProcessing )
	
	if ( Field.Name = "Job" ) then
		StandardProcessing = false;
		ShowValue ( , Item.CurrentData.Job );
	endif;
	
EndProcedure

&AtServerNoContext
Procedure ListOnGetDataAtServer ( ItemName, Settings, Rows )
	
	for each item in Rows do
		data = item.Value.Data;
		end = ? ( data.Status = Enums.JobStatuses.Running, CurrentUniversalDateInMilliseconds (), data.Finish );
		data.Duration = Conversion.PeriodToDuration ( data.Start, end );
	enddo;
	
EndProcedure
